a{"adult":false,"backdrop_path":"/l94l89eMmFKh7na2a1u5q67VgNx.jpg","belongs_to_collection":null,"budget":0,"genres":[{"id":18,"name":"Drama"},{"id":35,"name":"Comedy"}],"homepage":"","id":3,"imdb_id":"tt0092149","original_language":"fi","original_title":"Varjoja paratiisissa","overview":"An episode in the life of Nikander, a garbage man, involving the death of a co-worker, an affair and much more.","popularity":5.879,"poster_path":"/nj01hspawPof0mJmlgfjuLyJuRN.jpg","production_companies":[{"id":2303,"logo_path":null,"name":"Villealfa Filmproductions","origin_country":"FI"}],"production_countries":[{"iso_3166_1":"FI","name":"Finland"}],"release_date":"1986-10-17","revenue":0,"runtime":74,"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"},{"english_name":"Swedish","iso_639_1":"sv","name":"svenska"},{"english_name":"Finnish","iso_639_1":"fi","name":"suomi"}],"status":"Released","tagline":"","title":"Shadows in Paradise","video":false,"vote_average":7.2,"vote_count":144}
 // REVIEWS 
{"id":3,"page":1,"results":[{"author":"CRCulver","author_details":{"name":"","username":"CRCulver","avatar_path":null,"rating":7},"content":"Released in 1986, Aki Kaurismaki's <i>Varjoja paratiisissa</i> (Shadows in Paradise) is one of the Finnish filmmaker's earliest efforts, and it stands as one of the most idiosyncratic romantic comedies of all time. The painfully shy Nikander (Matti Pellonpää), a garbage man, means the moody Ilona, a supermarket checkout girl. The film tracks their bumbling attempt to establish a lasting relationship: dates that end as soon as they've begun, a romantic getaway where they each retreat to separate hotel rooms, and rare conversations which employ the absolute bare minimum of words. Nikander's best and only friend Melartin (Sakari Kuosmanen), whom the garbage man only recently met through a spell in jail, gives some needed encouragement.\r\n\r\nThe film's soundtrack is rooted in early rock-and-roll, though unlike later Kaurismaki films where the characters seem to be living in a 1950s bubble, all the action takes place in contemporary Helsinki. I've criticized Kaurismaki's vision of Finland in other films, but <i>Varjoja paratiisissa</i> does, in my opinion, accurately depict the collection of gloomy, taciturn binge drinkers that are the Finns.\r\n\r\n<i>Varjoja paratiisissa</i> is an early work and doesn't show the confidence of later efforts, but it's still quite entertaining, its leads and their struggles extremely charming, and I would recommend the film. Certainly the performances of Pellonpää (in a typical Pellonpää role) and Outinen (who seemingly reinvents herself in every film) will prove quite memorable.","created_at":"2018-09-06T19:31:51.288Z","id":"5b9180a7c3a3687adc005547","updated_at":"2021-06-23T15:58:12.193Z","url":"https://www.themoviedb.org/review/5b9180a7c3a3687adc005547"}],"total_pages":1,"total_results":1}