{
  "id": 460465,
  "page": 1,
  "results": [
    {
      "author": "TheDarkKnight31",
      "author_details": {
        "name": "",
        "username": "TheDarkKnight31",
        "avatar_path": null,
        "rating": 10
      },
      "content": "I will be short. You should understand how hard to make movies based on such a legendary universe (expectation is too high!), with a lot of characters that need screen time, and with limited budget, PLUS in a pandemic situation, - the director made a great job.\r\n\r\nThis is the best adaptation of such a legendary title.",
      "created_at": "2021-04-12T05:39:44.021Z",
      "id": "6073dd204d0e8d0043061b63",
      "updated_at": "2021-06-23T15:58:54.325Z",
      "url": "https://www.themoviedb.org/review/6073dd204d0e8d0043061b63"
    },
    {
      "author": "garethmb",
      "author_details": {
        "name": "",
        "username": "garethmb",
        "avatar_path": "/https://secure.gravatar.com/avatar/3593437cbd05cebe0a4ee753965a8ad1.jpg",
        "rating": null
      },
      "content": "Mortal Kombat Gives Fans Of The Franchise The Brutal Live-Action Version They Deserve\r\nFans of the Mortal Kombat series have known that the path to bringing the violent and controversial game to live-action formats has been a mixed bag. While the first film in 1995 was a decent hit; the follow-up in 1997 disappointed fans who had grown weary of the PG-13 take on the series.\r\n\r\nSubsequent efforts such as the 2011 television series also left fans wanting more; especially since the game series had become even more graphic and violent.\r\n\r\nAn animated film released in 2020 gave fans a taste of what they wanted as it featured graphical violence which many fans believed was essential to properly catch the spirit and action of the series.\r\n\r\nThe latest offering in the series “Mortal Kombat”; reboots the cinematic universe and gives fans the intense, brutal, and graphic violence that they have demanded. The film keeps the basic premise that the Outworld realm has won nine tournaments in a row, and based on the ancient laws; one more victory would allow them to take control of the Earth.\r\n\r\nRaiden the Thunder God (Tadanobu Asano); who has been tasked with protecting Earth looks to assemble and train a band of champions to save Earth. Naturally, this is not going to be easy as Shang Tsung (Chin Han); is not willing to follow the rules of the tournament and dispatches his top fighter (Sub Zero (Joe Taslim) to dispatch the champions of Earth before the tournament in a clear violation of the rules in order to ensure total victory.\r\n\r\nWhat follows is solid and very graphic action which contains gore and brutality on a level that almost kept the film from earning an R-rating. The action sequences are well-choreographed and there were some great recreations of classic moves by characters from the game series which were really well utilized and did not seem like gratuitous pandering.\r\n\r\nWhile the plot is fairly simplistic and does not deviate greatly from the source material; it does give a larger backstory to the universe. It was really enjoyable to see many nods to the franchise throughout both subtle and overt and while some characters were glaringly absent which was a surprise; the characters that were included were really solid to see and the door was wide open for their inclusion at a later date.\r\n\r\nWhile the cast does not contain any star power in terms of what Western audiences might expect from a major studio release; the ensemble works well and do a great job in bringing their characters to life.\r\n\r\nThe film leaves sequels wide open and teases a character that in my opinion was a glaring omission from the film. That being said; “Mortal Kombat” gives fans a solid adaptation that does not shy away from gore and violence and gives fans the cinematic experience that they have wanted.\r\n\r\n3.5 stars out of 5",
      "created_at": "2021-04-22T23:16:21.703Z",
      "id": "608203c52b8a430029d0a07d",
      "updated_at": "2021-06-23T15:58:54.738Z",
      "url": "https://www.themoviedb.org/review/608203c52b8a430029d0a07d"
    },
    {
      "author": "msbreviews",
      "author_details": {
        "name": "",
        "username": "msbreviews",
        "avatar_path": "/https://secure.gravatar.com/avatar/992eef352126a53d7e141bf9e8707576.jpg",
        "rating": 6
      },
      "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nEven though I consider myself somewhat of a gamer, I was never the biggest fan of the Mortal Kombat games, probably because I never really knew how to play them. Besides occasional visits to my neighbor's house to play several games on his PlayStation 1 (or 2?), I've only played this game on the nostalgic arcade machines that gave me incredible joy when I was younger. In all honesty, I don't exactly remember if I watched the previous film adaptations of the popular franchise, but I do know that both didn't receive the best feedback from critics and audiences, especially the 1997's flick. Therefore, I went to the theater - first time in over four months - with no real expectations. I just hoped the action would compensate for the predictably flawed screenplay.\r\n\r\nAll in all, I'm surprised at how much I actually had fun with this movie. Considering this is Simon McQuoid's feature directorial debut, as well as Greg Russo's first screenplay credit, my hopes rested on Dave Callaham's previous works (Wonder Woman 1984, Zombieland: Double Tap) and on the gory, violent action sequences. The latter component is the best element in the entire film, which will definitely leave the viewers in search of action-heavy entertainment satisfied. The opening sequence shows the merciless brutality of each fight through phenomenal stunt work (Hiroyuki Sanada is impressively talented), long takes with exceptional choreography, and a shocking amount of blood - something quite characteristic of the game franchise.\r\n\r\nThe only negative aspect about this opening is the fact that no other action scene surpasses it, which doesn't mean that the rest of the battles fail to live up to the expectations of the most avid fans. Despite a few shaky, roughly edited scenes, the vast majority of the fights are easy to follow and feature jaw-dropping moments, such as the \"Fatality!\" finishing moves. McQuoid and his team of writers try to make the movie understandable and exciting to everyone, but if there's a chance of placing a reference, an Easter Egg, or something alike, they proudly and unrestrainedly present it to the audience, which will trigger the most hardcore fans to let go of a resounding, adrenaline-fueled \"YEAH!\".\r\n\r\nI admit that I didn't expect the film to deliver those epic announcements from the game. From \"Flawless Victory!\" to \"Fatality!\", without forgetting the classic \"Fight!\", I did smile during these moments, where the actors actually change the tone of their voice to mimic the famous one-liners. Is it extraordinarily cheesy and over-the-top? Of course. Would any fan want it any other way? It might be a tad too much for some viewers, but I have to compliment McQuoid for fully committing to this adaptation. There's no ounce of shame, regret, or restraint. It's a movie made with a passionate public in mind, and I wholeheartedly recommend it to every single fan of the games.\r\n\r\nI firmly believe people will end up liking or disliking this film based on how much the action compensates for the lack of a compelling story, which is something even the most enthusiastic fans are probably anticipating as well. From a couple of nonsensical narrative decisions to hollow, uninteresting characters, the screenplay is solely focused on explaining everything surrounding Mortal Kombat - Earthworld, Outworld, champions, stakes, rules of the tournament - through lazy yet admittedly efficient exposition scenes. The characters could have been better developed, and the actors are far from being completely convincing. However, no one will enter the theater or click \"play\" on HBO Max expecting to witness an Oscar-worthy story...\r\n\r\nMortal Kombat is a surprisingly decent adaptation of the popular franchise, which will leave the most hardcore fans quite satisfied. For viewers with no experience or knowledge about the games, it could be a tough watch. However, if all the audience seeks is action-heavy entertainment, then Simon McQuoid's directorial debut fulfills the more reasonable expectations. Packed with references that even the least avid gamers will recognize, the fighting scenes are mostly well-filmed and quite energetic, focusing more on the gruesome, bloody, jaw-dropping Fatalities. Despite the opening sequence being the peak of great action, there are a couple of moments that could be compared to some parts of that epic start. Story-wise, Greg Russo and Dave Callaham's screenplay is as flawed as expected, possessing ridiculous developments and an abundance of dull exposition scenes, but it's the underwhelming use of a few interesting characters that negatively impacts the movie the most. In the end, I definitely recommend it to fans of the franchise, who will surely appreciate this film a lot more than myself.\r\n\r\nRating: B-",
      "created_at": "2021-04-24T20:23:48.438Z",
      "id": "60847e545c3247007764906c",
      "updated_at": "2021-06-23T15:58:54.784Z",
      "url": "https://www.themoviedb.org/review/60847e545c3247007764906c"
    },
    {
      "author": "sykobanana",
      "author_details": {
        "name": "",
        "username": "sykobanana",
        "avatar_path": "/j2KpvD880J95lqf3ct4u1MmWZhE.jpg",
        "rating": 7
      },
      "content": "I liked this more than I should have.  \r\n\r\nI have tried the games, but am not into the fighting genre of games (although the Injustice series grabbed me for its story).  The previous movies were fun and didnt take themselves seriously - which was good, but they got too hammy and over the top.  The last cartoon took itself way to seriously and was disappointing and forgettable to say the least.  \r\n\r\nThis movie, however seemed to grab everything good from the previous attempts, added actors who know some martial arts, used some of the key terms and moves from the games and had a stand out performance from Josh Lawson as Kano adding the 'very dry type of  Australian' humour.  Hell, the score was even good.  \r\n \r\nGiven that this is pretty much the same as the game - 10-12 fights some spectacular fatalities and a basic plot with no character development - this was a very fun way to spend 2 hours.",
      "created_at": "2021-04-24T23:19:54.151Z",
      "id": "6084a79a8d22fc003f1c11de",
      "updated_at": "2021-06-23T15:58:54.808Z",
      "url": "https://www.themoviedb.org/review/6084a79a8d22fc003f1c11de"
    },
    {
      "author": "JPV852",
      "author_details": {
        "name": "",
        "username": "JPV852",
        "avatar_path": "/xNLOqXXVJf9m7WngUMLIMFsjKgh.jpg",
        "rating": 5
      },
      "content": "Fluff entertainment at its most bland. The fighting is pretty forgettable but at least they utilized the R rating for some decent gore that honors the game at least. Acting is at best so-so while the dialogue was pretty bad and it probably 10-15 minutes too long. Can't say I'll remember this but for what it is, it's fine as a time-waster. **2.75/5**",
      "created_at": "2021-04-30T17:59:11.344Z",
      "id": "608c456f66469a00428df802",
      "updated_at": "2021-06-23T15:58:55.015Z",
      "url": "https://www.themoviedb.org/review/608c456f66469a00428df802"
    },
    {
      "author": "Chris",
      "author_details": {
        "name": "Chris",
        "username": "chrisman89",
        "avatar_path": "/r3rzQSscSUfxTOHfE0yHqw3RYU9.jpg",
        "rating": 10
      },
      "content": "Okay so let's start by saying I wasn't exactly sure what to think going into this movie I didn't know what was going to happen but wow this is one of the best action films of the decade so far yeah it started slow but really was a good full time of excitement",
      "created_at": "2021-05-10T16:54:35.282Z",
      "id": "6099654b72a2c9003e33c4f2",
      "updated_at": "2021-06-23T17:09:58.586Z",
      "url": "https://www.themoviedb.org/review/6099654b72a2c9003e33c4f2"
    },
    {
      "author": "Rene",
      "author_details": {
        "name": "Rene",
        "username": "The_Bad_Critic",
        "avatar_path": "/q3zcMPYz1m7sZ8jD4ol5m6gHBQI.png",
        "rating": 6
      },
      "content": "OK LETS start off with if you have not watched the latest animations of mortal kombat this will movie will make you feel abit effy. You will need more background on the actual characters you know from previous movies and those you don't. and the True scorpion and sub zero animation also covers alot. Good fighting movie though. Shouting GET OVER HERE!!!!!!and FINISH HIM haha it makes a person feel like you part of it.",
      "created_at": "2021-07-08T19:23:24.122Z",
      "id": "60e750acb76cbb00461c9fbd",
      "updated_at": "2021-07-08T23:09:54.327Z",
      "url": "https://www.themoviedb.org/review/60e750acb76cbb00461c9fbd"
    }
  ],
  "total_pages": 1,
  "total_results": 7
}
